<template>
    <div class="protocol-wrapper">
    <h1 class="title">英语天天见课程协议</h1>
    <p class="title-2">如有任何问题，联系“英语天天见”客服人员。</p>
    <p class="title-2">本协议中，“甲方”是指购买乙方相应课程的自然人；“乙方”是指“北京智博汇晶教育科技有限公司”。</p>
    <h2 class="title-1">第一部分 本协议的签署和生效</h2>
    <p class="title-2">本协议内容包括本协议正文所载之各条款及乙方相关宣传页面已经发布的或将来可能发布的各类课程规则、服务规则（下称“乙方规则”）；所有该等乙方规则均为本协议不可分割的一部分，与本协议正文具有同等法律效力。本协议是甲方与乙方自愿共同签订的，适用于甲方的全部课程活动。</p>
    <p class="title-2">甲方应当向乙方提供个人正确、完整的信息（包括真实姓名电话及各项相关资料）。如因甲方提供的资料不实或者不明确，致使任何一方受到任何延误或者损失的，应当由甲方承担相应责任。</p>
    <p class="title-2">在甲方购买乙方课程时，甲方应已年满18岁，且已经阅读、理解并接受本协议正文的全部条款及乙方规则，并承诺阅读、理解并接受乙方不时发布的乙方规则。甲方确认在已知悉并接受本协议的前提下支付课程费用。一旦甲方完成课程购买并支付相应费用，即意味着甲方已阅读本协议所有条款，并对本协议条款的含义已充分理解，同意受本协议约束。</p>
    <p class="title-2">本协议中的“学员”或者“甲方学员”是指学习甲方所购买的课程包的一名固定学员。乙方按照该学员个人的学习状况和知识储备情况确定其起始级别并配备相应课程内容，为确保最佳的学习效果，整个学习过程中甲方不得更换或者增加学员。</p>
    <p class="title-2">甲方的课程购买行为视为甲方本人的真实意思表示和甲方本人的行为，本协议自乙方收到甲方支付的全部正式课程费用起生效，一经成立生效即不可撤销。</p>
    <h2 class="title-1">第二部分 课程服务</h2>
    <p class="title-2">甲方购买课程后，可以享受所购课程相关服务，如录播课、单词卡、活动等。</p>
    <p class="title-2">乙方向甲方赠送的同类型课程（如有）将在甲方购买的全部课程使用完毕以后方能开始使用。</p>
    <p class="title-2">乙方向甲方赠送的非同类型课程（如有）将根据此类型课程安排时间使用。课程时间以APP或微信公众号的通知为准）</p>
    <p class="title-2">乙方向甲方赠送的实体物品，包含但不限于书籍、书包、礼品等，工本费以宣传为准。</p>
    <p class="title-2">如甲方申请退费，甲方在购买课程时赠送的虚拟项目将自动取消，已经消费的部分不扣费；实体物品未使用（寄回后由乙方检验）且寄回的不扣除工本费，已经使用的需要扣除工本费；</p>
    <p class="title-2">乙方提供的直播课程等服务都有固定的服务期限，根据期限分为“常规课”、“非常规课”；</p>
    <p class="title-2">“常规课”期限分别为：30天、180天、365天、730天；其中最低期限为一个非自然月（30天），价格为¥199元/非自然月；其余期限课程为“非常规课”；</p>
    <p class="title-2">非自然月：是从一个月份中的任一天开始,到下个月份的相同日期的那一天为止；</p>
    <p class="title-2">关于退费：</p>
    <p class="title-2">“非常规课”不支持退费；</p>
    <p class="title-2">“常规课”支持退费；</p>
    <p class="title-2">支付完成后，如果甲方退费，则按非自然月扣除：自支付日期起计算，30天内（包含30天）算一个非自然月，天数不到30天的按照一个非自然月计算。</p>
    <p class="title-2">退费金额的计算公式如下：</p>
    <p class="title-2">退费金额=支付金额-已使用非自然月数*199元/非自然月-工本费（如需扣款）。</p>
    <p class="title-2">退款时，甲方须自费提供并交回已经开具的发票。如不能提供乙方开具的发票，乙方有权从退款中直接扣除发票金额的8%，以支付当地发票税赋和相关费用。</p>
    <p class="title-2">退款流程和时间通常为批准退款申请日起2至3周，乙方将按照交款时的方式和账号进行退款。</p>
    <h2 class="title-1">第三部分 双方的权利义务</h2>
    <p class="title-2">甲方的权利和义务：</p>
    <p class="title-3">甲方学员不得影响乙方的正常运营，不得影响课程进程及其他学员的学习活动。</p>
    <p class="title-3">甲方学员在课程学习期内，如遇有任何问题，可以在课程服务时间与乙方的工作人员取得联系。</p>
    <p class="title-3">甲方学员不得发布不实言论损害乙方或乙方员工的名誉。</p>
    <p class="title-3">在任何情况下，甲方学员不得以任何方式出售或转让乙方提供的全部或部分培训课程。</p>
    <p class="title-3">甲方同意自行配备宽带上网设备及其他学习乙方课程所需软件和硬件设备。</p>
    <p class="title-3">为保护所有注册人及学员的权益，甲方不得利用乙方网站及系统平台搜集、探询、索取其他学员及学员家长以及老师之个人信息、联络方式(例如电子邮件信箱、QQ账号、WeChat账号、微博账号等)、交友及财务状况等等。</p>
    <p class="title-3">甲方签订本协议表明其遵守乙方制定的授课安排及学校的各项规章制度，与乙方保持密切联系和良好沟通，以完成本协议项下的课程学习。</p>
    <p class="title-2">乙方的权利和义务：</p>
    <p class="title-3">在保证培训质量的前提下，乙方有权改进、调整变更其培训服务、课程安排或其他事项。但乙方应将上述任何变更通过网站或本协议中列明的联系方式及时通知甲方。</p>
    <p class="title-3">乙方应根据甲方提出的要求，在约定范围内提供相应技术支持服务，并及时回应甲方提出的问题和意见。</p>
    <p class="title-3">因乙方课程变更、知识产权、系统升级、法律纠纷等原因不能继续正常提供在线课程服务时，需要提前2-3周时间告知甲方，若是突发情形无法提前2-3周告知的，应尽快告知甲方，并向甲方提供替代性的课程服务。</p>
    <h2 class="title-1">第四部分 个人信息及保密</h2>
    <p class="title-2">为便于乙方了解学员情况、更好地履行本协议项下义务，甲方应向乙方提供学员的部分个人信息。甲方同意乙方可将学员的个人信息用于公司内部的教学管理等目的，但应注意依法严格保护学员的个人隐私。</p>
    <p class="title-2">如甲方提供的学员信息发生变更，甲方应及时通知乙方工作人员；由于甲方未及时通知的而导致乙方无法联系到甲方、使学员的学习受到影响的，甲方应自行承担责任。</p>
    <p class="title-2">甲方同意应妥善保管其课程账户和密码，并对任何人利用其账户和密码所进行的活动负责。如学员的账户和密码遭到未获授权的使用，或者发生其他任何安全问题，甲方应立即通知乙方的工作人员，要求乙方工作人员暂停相关服务。甲方亦不得将其账号和密码出借、转移或者让与第三人使用。如乙方合理怀疑甲方违反本约定，乙方有权暂时停止甲方账户之使用，如果乙方最终确认甲方违反本约定，乙方有权立即终止本协议。</p>
    <p class="title-2">未经乙方书面同意及授权，甲方不得以任何方式将因本协议之订立或执行所得悉的乙方之技术数据、商业秘密及其他机密资料和信息提供给任何第三人或向第三人披露，如有违反，乙方有权立即终止本协议并要求甲方赔偿其损失。</p>
    <h2 class="title-1">第五部分 知识产权</h2>
    <p class="title-2">以下所述资料的所有权及全部、完整的知识产权归乙方享有：（1）乙方为培训课程所制作的全部资料（包括但不限于教材教辅、课件及教学相关材料等）；（2）在教学过程中产生的全部资料（包括但不限于任何教学视频、教学方案等）；（3）乙方网站上所显示、使用或提供之软件、程序及内容。未经乙方同意，甲方学员在任何时候（包括本协议有效期内及协议终止后）均不得：①为商业目的对上述资料进行利用；②以任何方式翻译、复制、传播、编辑上述资料；以及③将上述资料透露给任何第三方。</p>
    <p class="title-2">甲方同意，在甲方学员参与的培训课程中，或甲方学员参与乙方组织、举办的其他活动中，乙方可以进行拍照、摄像、录音、录像等记录活动。乙方对上述记录活动过程中所产生的作品、录音录像制品等单独地享有全部、完整的知识产权。乙方同意依法为甲方学员的个人信息采取严格的保密措施。未经甲方同意，乙方不得将上述包含甲方学员肖像或者显示个人身份的其他个人信息进行公开地商业使用。仅当以下情况之一发生时，乙方可以对甲方的肖像、姓名等个人信息进行合理使用，乙方无须再单独取得甲方同意，也无须向甲方支付任何费用：（1）甲方学员的肖像、姓名等合法民事权益，已被明确放弃；（2）为乙方内部的展示/使用需要，包括但不限于在内部会议中展示、将相关资料作为历史档案留存于乙方档案库或者服务器上等。</p>
    <h2 class="title-1">第六部分 培训费用</h2>
    <p class="title-2">根据本协议约定，乙方向甲方提供课程服务，甲方应当向乙方支付相应的培训费用，具体金额以乙方的课程宣传页面为准。</p>
    <h2 class="title-1">第七部分 禁止劝诱</h2>
    <p class="title-2">乙方的员工、老师（包括外教和中国老师）为其公司存续及发展的重要支撑力量，任何人非经乙方同意不得在使用乙方课程中及课程结束后，以任何方式劝诱、要求、或者邀请乙方的员工或者老师与乙方终止或者解除服务关系，或劝诱、要求、或者邀请乙方的员工或者老师接受由甲方自己或者甲方介绍的其他个人或组织提供（无论正式、兼职、或者临时组织的活动）的任何职务。</p>
    <p class="title-2">如有违反，甲方应当向乙方承担违约金，违约金的金额为上述人员离职前所在的乙方岗位上一年度年薪或报酬的两（2）倍。</p>
    <h2 class="title-1">第八部分 违约责任</h2>
    <p class="title-2">本协议任何一方违约，均应承担违约责任，对另一方因此产生的损失承担赔偿责任。</p>
    <p class="title-2">如果乙方违约，甲方有权随时以通知乙方的方式终止本协议，并要求乙方按照本协议第四部分约定的退费方式进行退费。给甲方造成损失的，乙方应当承担相应违约责任，乙方因未能履行本协议项下的义务而需承担的全部责任的上限为甲方学员支付的课程费用总额。</p>
    <p class="title-2">如果甲方违约，乙方有权随时以通知甲方的方式终止本协议，甲方的违约行为给乙方造成损失的，乙方有权先行在甲方已经支付但尚未使用的课程费用中扣除相应金额。</p>
    <h2 class="title-1">第九部分 不可抗力</h2>
    <p class="title-2">本协议所称“不可抗力”指不能预见、不能避免并不能克服的客观情况，如重大自然灾害、瘟疫、战争、骚乱等。</p>
    <p class="title-2">任何一方因不可抗力事件而不能履行本协议的，可在事件影响范围内相应免责，但该方应立即通知对方，并自不可抗力事件发生之日起15 日内提供有关部门出具的有效证明。</p>
    <h2 class="title-1">第十部分 其他事项</h2>
    <p class="title-2">在甲方的课程到期结束后，本协议自动终止，甲方所拥有的课程账号同时失效。但本协议的终止不影响第六部分、第七部分和第八部分有关保密知识产权及禁止劝诱条款的效力。</p>
    <p class="title-2">乙方有权不时根据课程和管理改进的需要对本协议及网站的内容进行修改，并在网站中公布。修改后的协议一旦被张贴在乙方网站上即生效，并代替原来的协议，甲方可随时登录查阅最新协议。如甲方不同意更新后的协议，应立即书面通知乙方并立即停止接受乙方依据本协议提供的服务；如甲方未在2个工作日内书面通知乙方或用户继续使用乙方提供的服务的，即视为同意更新后的协议。</p>
    <p class="title-2">协议经甲方确认并同意后，将以电子文件方式留存于乙方公司系统中，以为双方协议签署及遵循的依据。</p>
    <p class="title-2">如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
    <h2 class="title-1">第十一部分 法律管辖和争议解决</h2>
    <p class="title-2">本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律（不包括香港澳门特别行政区及台湾地区法律）。</p>
    <p class="title-2">本协议只适用于乙方旗下品牌的常规课、非常规课课程学员，不包括体验课。协议中未尽事宜，双方依据乙方公司的公示内容为准。如有任何争议，双方应当尽量友好协商解决。协商不成，双方同意将争议提交至北京仲裁委员会进行仲裁，仲裁地在北京。</p>
    </div>
</template>
<script>
    export default {
        name: "protocol",
        components: {},
        data: () => {
            return {};
        },
        methods: {},
        created: function () {
            // isNeedBind(this);
            // this.$loading.hide();
        },
        mounted: function () {}
    };
</script>
<style lang="less" scoped>
    .protocol-wrapper {
        width: 100%;
        padding: 20px;
        box-sizing: border-box;
        color: white;
        background: #78557f;
        h1 {
            font-size: 32px;
            line-height: 56px;
            text-align: center;
            margin-top: 20px;
        }
        h2 {
            font-size: 28px;
            line-height: 50px;
            margin-top: 20px;
        }
        .p1 {
            font-size: 25px;
            margin-top: 10px;
        }
        .p2 {
            font-size: 24px;
            margin-left: 15px;
            margin-top: 5px;
        }
    }
</style>
