<template>
    <div class="protocol-wrapper">
    <h1 class="title">英语天天见用户注册协议</h1>
    <h2 class="title-1">1. 特别提示</h2>

    <p class="title-2">1.1 英语天天见同意按照本协议的规定及其不时发布的操作规则提供基于互联网以及移动网的相关服务（以下称“网络服务”），为获得网络服务，服务使用人（以下称“用户”）应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户在进行注册程序过程中点击“同意”按钮即表示用户完全接受本协议项下的全部条款。</p>
    <p class="title-2">1.2 用户注册成功后，英语天天见将给予每个用户一个用户帐号及相应的密码，该用户帐号和密码由用户负责保管；用户应当对以其用户帐号进行的所有活动和事件负法律责任。</p>
    <p class="title-2">1.3 用户注册成功，英语天天见将会通过电话或微信向每位注册用户进一步介绍本公司的相关服务情况。用户的注册行为即视同为同意接受公司进一步的服务。</p>

    <h2 class="title-1">2. 服务内容</h2>
    <p class="title-2">2.1 网络服务的具体内容由英语天天见根据实际情况提供，例如在线课程、公开课程、游戏、论坛、基于微信服务号的各类服务等。</p>
    <p class="title-2">2.2 英语天天见提供的部分网络服务为收费的网络服务，用户使用收费网络服务需要向英语天天见支付一定的费用。对于收费的网络服务，英语天天见会在用户使用之前给予用户明确的提示，只有用户根据提示确认其愿意支付相关费用，用户才能使用该等收费网络服务。如用户拒绝支付相关费用，则英语天天见有权不向用户提供该等收费网络服务。</p>
    <p class="title-2">2.3 用户理解，英语天天见仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费）均应由用户自行负担。</p>

    <h2 class="title-1">3. 服务变更、中断或终止</h2>
    <p class="title-2">3.1 鉴于网络服务的特殊性，用户同意英语天天见有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。如变更、中断或终止的网络服务属于免费网络服务，英语天天见无需通知用户，也无需对任何用户或任何第三方承担任何责任；如变更、中断或终止的网络服务属于收费网络服务，英语天天见应当在变更、中断或终止之前事先通知用户，并应向受影响的用户提供等值的替代性的收费网络服务，如用户不愿意接受替代性的收费网络服务，就该用户已经向英语天天见支付的服务费，英语天天见应当按照该用户实际使用相应收费网络服务的情况扣除相应服务费之后将剩余的服务费退还给该用户。</p>
    <p class="title-2">3.2 用户理解，英语天天见需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，英语天天见无需为此承担任何责任，但英语天天见应尽可能事先进行通告。</p>
    <p class="title-2">3.3 用户理解，对于直播类网络服务，英语天天见将尽全力保障直播类网络服务的可用性。若由于直播播出方或直播平台出现的不可预料的问题而导致英语天天见临时中断或取消直播服务，英语天天见在问题修复后可根据实际情况提供替代性的直播服务，但不承担任何其它赔偿责任。</p>
    <p class="title-2">3.4 如发生下列任何一种情形，英语天天见有权随时中断或终止向用户提供本协议项下的网络服务（包括收费网络服务）而无需对用户或任何第三方承担任何责任：</p>
    <p class="title-3">3.4.1 用户提供的个人资料不真实；</p>
    <p class="title-3">3.4.2 用户违反本协议中规定的使用规则；</p>
    <p class="title-3">3.4.3 用户在使用收费网络服务时未按规定向英语天天见支付相应的服务费。</p>
    <p class="title-3">3.4.4 用户对英语天天见的网络服务进行不切实际的评价或诋毁。</p>
    <p class="title-2">3.5 如用户注册的免费网络服务的帐号在任何连续180日内未实际使用，或者用户注册的收费网络服务的帐号在其订购的收费网络服务的服务期满之后连续180日内未实际使用，则英语天天见有权删除该帐号并停止为该用户提供相关的网络服务。</p>

    <h2 class="title-1">4. 使用规则</h2>
    <p class="title-2">4.1 用户在申请使用英语天天见网络服务时，必须向英语天天见提供准确的个人资料，如个人资料有任何变动，必须及时更新。</p>
    <p class="title-2">4.2 用户不应将其帐号、密码转让或出借予他人使用。如用户发现其帐号遭他人非法使用，应立即通知英语天天见。因黑客行为导致帐号、密码遭他人非法使用，英语天天见不承担任何责任。因用户个人保管不当而造成用户账号、密码被非法使用，对由此造成的任何账户内损失，用户个人将承担全部责任。若因用户个人原因导致用户账号被盗用，且盗用方对英语天天见提供的网络服务进行了恶意干扰、破坏等从而影响到英语天天见的正常运营并给其他用户造成了不良影响，英语天天见保留向盗用者及被盗账号所有者追讨相关责任的一切权利。</p>
    <p class="title-2">4.3 用户同意英语天天见有权在提供网络服务过程中以各种方式投放各种商业性广告或其他任何类型的商业信息（包括但不限于在英语天天见产品的任何页面上投放广告），并且，用户同意接受英语天天见通过电子邮件或其他方式向用户发送商品促销或其他相关商业信息。</p>
    <p class="title-2">4.4 对于用户通过英语天天见网络服务提供的可公开获取的任何内容，用户同意英语天天见在全世界范围内具有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，以使用、复制、修改、改编、出版、翻译、据以创作衍生作品、传播、表演和展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。</p>
    <p class="title-2">4.5 用户在使用英语天天见网络服务过程中，必须遵循以下原则：</p>
    <p class="title-3">4.5.1 遵守中国有关的法律和法规；</p>
    <p class="title-3">4.5.2 遵守所有与网络服务有关的网络协议、规定和程序；</p>
    <p class="title-3">4.5.3 不得为任何非法目的而使用网络服务系统；</p>
    <p class="title-3">4.5.4 不得以任何形式使用英语天天见网络服务侵犯英语天天见的商业利益，包括并不限于发布非经英语天天见许可的商业广告、无论出于何种目的未经授权盗取英语天天见网络服务的任何内容进行盈利性的或非盈利的传播等；</p>
    <p class="title-3">4.5.5 不得利用英语天天见网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；</p>
    <p class="title-3">4.5.6 不得利用英语天天见提供的网络服务上传、展示或传播任何虚假的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</p>
    <p class="title-3">4.5.7 不得侵犯其他任何第三方的专利权、著作权、商标权、名誉权或其他任何合法权益；</p>
    <p class="title-3">4.5.8 不得利用英语天天见网络服务系统进行任何不利于英语天天见的行为；</p>
    <p class="title-2">4.6 英语天天见有权对用户使用英语天天见网络服务的情况进行审查和监督(包括但不限于对用户存储在英语天天见的内容进行审核)，如用户在使用网络服务时违反任何上述规定，英语天天见或其授权的人有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户张贴的内容等、暂停或终止用户使用网络服务的权利）以减轻用户不当行为造成的影响。</p>
    <p class="title-2">4.7 英语天天见针对某些特定网络服务的使用通过各种方式（包括但不限于网页公告、电子邮件、短信提醒等）作出的任何声明、通知、警示等内容视为本协议的一部分，用户如使用该等英语天天见网络服务，视为用户同意该等声明、通知、警示的内容。</p>
    <p class="title-2">4.8 凡用户昵称中出现如下信息者（包括但不限于），英语天天见有权进行屏蔽、锁定，甚至注销：</p>
    <p class="title-3">4.8.1.使用严重违反国家法律法律及风序良俗，包含或暗藏反动、色情等信息（含符号、地址等）的昵称；</p>
    <p class="title-3">4.8.2.使用党和国家领导人、古今中外比较有影响的名人、网络上知名人士的真实姓名、字、号、艺名、笔名、头衔等为昵称；</p>
    <p class="title-3">4.8.3.使用国家机构、企事业单位、知名公司或品牌的名称及标识为昵称；</p>
    <p class="title-3">4.8.4.含性别歧视、种族歧视、地域歧视等信息的昵称；</p>
    <p class="title-3">4.8.5.含自侮辱、猥亵或者对他人进行侮辱、挑衅、漫骂、人身攻击等不文明、不健康信息的昵称；</p>
    <p class="title-3">4.8.6.含易产生歧义、引起他人误解的信息的昵称；</p>
    <p class="title-3">4.8.7.未获得英语天天见官方正式许可而使用带有英语天天见相关名称的昵称；</p>
    <p class="title-3">4.8.8.与英语天天见老师、及社区管理人员的昵称近似或雷同，并可能引起混淆或纠纷的；</p>
    <p class="title-3">4.8.9.带有明显广告性质的昵称；</p>
    <p class="title-3">4.8.10.带有其它法律法规以及论坛禁止规则中所包含信息的昵称。</p>

    <h2 class="title-1">5. 知识产权</h2>
    <p class="title-2">5.1 英语天天见提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。所有这些资料或资料的任何部分仅可作为私人和非商业用途而保存在某台计算机内。英语天天见不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式，向用户或任何第三方负责。</p>
    <p class="title-2">5.2 英语天天见为提供网络服务而使用的任何软件（包括但不限于软件中所含的任何图象、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse engineer）、反向编译（decompile）或反汇编（disassemble）。</p>

    <h2 class="title-1">6. 隐私政策</h2>
    <p class="title-2">保护用户隐私是英语天天见的一项基本政策，英语天天见的隐私政策请参见英语天天见官网（www.lexislive.com.cn）页面底部的“隐私政策”相关内容。</p>

    <h2 class="title-1">7. 免责声明</h2>
    <p class="title-2">7.1 用户明确同意其使用英语天天见网络服务所存在的风险将完全由其自己承担；因其使用英语天天见络服务而产生的一切后果也由其自己承担，英语天天见对用户不承担任何责任。</p>
    <p class="title-2">7.2 英语天天见不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保。</p>
    <p class="title-2">7.3 英语天天见不保证为向用户提供便利而设置的外部链接的准确性和完整性，同时，对于该等外部链接指向的不由英语天天见实际控制的任何网页上的内容，英语天天见不承担任何责任。</p>
    <p class="title-2">7.4 对于因不可抗力或英语天天见不能控制的原因造成的网络服务中断或其它缺陷，英语天天见不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
    <p class="title-2">7.5 用户同意，对于英语天天见向用户提供的下列产品或者服务的质量缺陷本身及其引发的任何损失，英语天天见无需承担任何责任：</p>
    <p class="title-3">7.5.1 英语天天见向用户免费提供的各项网络服务；</p>
    <p class="title-3">7.5.2 英语天天见向用户赠送的任何产品或者服务；</p>
    <p class="title-3">7.5.3 英语天天见向收费网络服务用户附赠的各种产品或者服务。</p>

    <h2 class="title-1">8. 违约赔偿</h2>
    <p class="title-2">8.1 如因英语天天见违反有关法律、法规或本协议项下的任何条款而给用户造成损失，英语天天见同意承担由此造成的损害赔偿责任。</p>
    <p class="title-2">8.2 用户同意保障和维护英语天天见及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给英语天天见或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。</p>

    <h2 class="title-1">9. 协议修改</h2>
    <p class="title-2">9.1 英语天天见有权随时修改本协议的任何条款，一旦本协议的内容发生变动，英语天天见将会直接在英语天天见网站上公布修改之后的协议内容，该公布行为视为英语天天见已经通知用户修改内容。英语天天见也可通过其他适当方式向用户提示修改内容。</p>
    <p class="title-2">9.2 如果不同意英语天天见对本协议相关条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受英语天天见对本协议相关条款所做的修改。</p>

    <h2 class="title-1">10. 通知送达</h2>
    <p class="title-2">10.1 本协议项下英语天天见对于用户所有的通知均可通过网页公告、电子邮件、手机短信或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。</p>
    <p class="title-2">10.2 用户对于英语天天见的通知应当通过英语天天见对外正式公布的通信地址、传真号码、电子邮件地址等联系信息进行送达。</p>

    <h2 class="title-1">11. 法律管辖</h2>
    <p class="title-2">11.1 本协议的订立、执行和解释及争议的解决均应适用中国法律并受中国法院管辖。</p>
    <p class="title-2">11.2 如双方就本协议内容或其执行发生任何争议，双方应尽量友好协商解决；协商不成时，任何一方均可向兰思英语所在地的人民法院提起诉讼。</p>

    <h2 class="title-1">12. 其他规定</h2>
    <p class="title-2">12.1 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。</p>
    <p class="title-2">12.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</p>
    <p class="title-2">12.3 本协议中的标题仅为方便而设，在解释本协议时应被忽略。</p>
    </div>
</template>
<script>
    export default {
        name: "protocol",
        components: {},
        data: () => {
            return {};
        },
        methods: {},
        created: function () {
            // isNeedBind(this);
            // this.$loading.hide();
        },
        mounted: function () {}
    };
</script>
<style lang="less" scoped>
    .protocol-wrapper {
        width: 100%;
        padding: 20px;
        box-sizing: border-box;
        color: white;
        background: #78557f;
        h1 {
            font-size: 32px;
            line-height: 56px;
            text-align: center;
            margin-top: 20px;
        }
        h2 {
            font-size: 28px;
            line-height: 50px;
            margin-top: 20px;
        }
        .p1 {
            font-size: 25px;
            margin-top: 10px;
        }
        .p2 {
            font-size: 24px;
            margin-left: 15px;
            margin-top: 5px;
        }
    }
</style>
