<template>
    <div class="protocol-wrapper">
        <h1>兰思英语课程协议</h1><br/>
        •	如有任何问题 联系兰思英语客服人员<br/>
•	本协议中，“甲方”是指购买乙方相应课程的自然人；<br/>“乙方”是指“北京智博汇晶教育科技有限公司”。<br/>
<h2>第一部分 课程信息</h2><br/>
•	课程基本信息：<br/>每72次课时为一个level，每次课时25分钟。<br/>
•	具体购买课程以甲方账号下的订单信息为准。<br/>
•	甲方可以自行选择时间合适的课程包，一旦付费购买，原则上不得更改课程包。<br/>
<h2>第二部分 本协议的签署和生效</h2><br/>
•	本协议内容包括本协议正文所载之各条款及乙方相关宣传页面已经发布的或将来可能发布的各类课程规则、服务规则（下称“乙方规则”）；<br/>所有该等乙方规则均为本协议不可分割的一部分，与本协议正文具有同等法律效力。<br/>本协议是甲方与乙方自愿共同签订的，适用于甲方的全部课程活动。<br/>
•	甲方应当向乙方提供个人正确、完整的信息（包括真实姓名电话及各项相关资料）。<br/>如因甲方提供的资料不实或者不明确，致使任何一方受到任何延误或者损失的，应当由甲方承担相应责任。<br/>
•	在甲方购买乙方课程时，甲方应已年满18岁，且已经阅读、理解并接受本协议正文的全部条款及乙方规则，并承诺阅读、理解并接受乙方不时发布的乙方规则。<br/>甲方确认在已知悉并接受本协议的前提下支付课程费用。<br/>一旦甲方完成课程购买并支付相应费用，即意味着甲方已阅读本协议所有条款，并对本协议条款的含义已充分理解，同意受本协议约束。<br/>
•	本协议中的“学员”或者“甲方学员”是指学习甲方所购买的课程包的一名固定学员。<br/>乙方按照该学员个人的学习状况和知识储备情况确定其起始级别并配备相应课程内容，为确保最佳的学习效果，整个学习过程中甲方不得更换或者增加学员。<br/>
•	甲方的课程购买行为视为甲方本人的真实意思表示和甲方本人的行为，本协议自乙方收到甲方支付的全部正式课程费用起生效，一经成立生效即不可撤销。<br/>
<h2>第三部分 课程服务</h2><br/>
•	乙方为学员提供一对二的外教在线视频教学服务，每班人数为2个人起开班，2个人为满班，每节课的时长为25分钟。<br/>
•	一旦班级组建完成，该班级将成为固定班级在固定时间由固定欧美外教老师进行在线授课。<br/>每个班级一旦正式开课，直到该学期课程结束方能解散，乙方将尽量保证授课老师完成全部课程，如果该学期课程的授课老师因故不能完成全部课程，乙方保证及时更换老师完成全部授课内容。<br/>如果该班级中的全部学员退出，则班级解散。<br/>如开课过程中班级学员人数少于二人，乙方保证仍将持续完成全部该学期课程，但乙方有权随时安排程度相当的插班学员，班级固定人数2人。<br/>
•	乙方将根据学员情况为其匹配相符的课程班，学员及其家长同意在该课程班进行学习。<br/>
•	关于补课，一旦学期开课，课程将按照教学进度进行，任何学员不得缺席。<br/>如果学员无法准时在原班级某次课程上课，请务必在计划所上课程开课前24小时申请补课，可以申请到同水平同教学进度的其他班级中完成当次课程的内容学习，其他课程内容仍然在原班级中完成。<br/>乙方在每学期为学员提供3次补课的申请机会（但乙方不保证一定能够补课成功），当学期未使用视为自动作废，不可累积。<br/>包含补课学生人数在内，班级总人数不超过4人。<br/>
•	如果学员无法按原班级进度上课，请务必在计划停止课程开课前48小时申请转班，可以申请转到同水平同教学进度且有剩余名额的班级上课，并在转到的班级中完成当学期的剩余所有课程。<br/>一旦甲方提出转班申请，学员应当立即停止按照原班级进度上课，学员的剩余课时冻结，乙方将尽快进行转班调度安排。<br/>乙方在每学期为学员提供1次转班申请的机会（但乙方不保证一定能够转班成功），当学期未使用视为自动作废，不可累积。<br/>
•	甲方所报课程自每节课上课时将自动考勤并扣除当节课的费用，如果学员无法准时上课，甲方可以在规定的时间内申请调课或者转班，如果符合协议约定，当节课程不扣费，若未能在规定的时间内申请或者不符合申请标准或者因为客观情况未能调课或者转班成功，则视为缺席，甲方每次缺席的课程都将被计算为已经完成的课程，会按照正常的课时扣费。<br/>
•	如果学员长期无法正常上课，甲方可以申请办理长期停课（最短不能少于七天，最长不得超过三个月），一旦甲方提出长期停课申请，学员应当立即停止按照原班级进度上课，学员的剩余课时冻结。<br/>待学员可正常上课，甲方可以向乙方申请复课，乙方根据该学员之前的课程完成情况，将该学员直接插班到相同进度相同水平且有剩余名额的班级完成剩余课程学习。<br/>乙方在每学期为学员提供1次长期停课的申请机会（但乙方不保证一定能够转班成功），当学期未使用视为自动作废，不可累积。<br/>
•	因学员原因，学员未能按时进入教室进行上课的，课程将按时开始和结束，学员及甲方不能要求课程延时。<br/>
•	如由于乙方的原因（包括但不限于乙方的授课教师迟到超过五分钟、临时无法授课、中途因故中止授课、乙方的授课系统出现故障超过五分钟等）导致甲方学员无法完成一次或者多次课程的，乙方将和班级中的学员家长协商合适的时间免费赠予相应数量和相同内容的在线课程。<br/>如乙方的授课教师迟到，但迟到未满五分钟（包含五分钟），该节课程则将相应顺延。<br/>如因为乙方的授课系统出现故障但该故障在五分钟之内（包含五分钟）恢复正常的，该节课程则将相应顺延。<br/>
<h2>第四部分 费用支付和课程退费</h2><br/>
•	课程总价=课单价×所购买的课程总数，课程总价需一次性缴清。<br/>
•	甲方根据本协议向乙方支付全部课程费用后，甲方学员方能成为乙方的正式学员。<br/>如果该学期的正式课程尚未开始进行，则甲方可以随时向乙方申请退还全部正式课程费用。<br/>
•	甲方根据本协议向乙方支付课程费用后, 如果当期课程已经开始上课，首次课程起30天或8节课内，如果您对课程或服务不满意，可随时申请退还未进行的课程的费用（即在甲方申请退费的第二个自然日起算尚未开始进行的课程），乙方向甲方退还的金额按照如下公式计算：退费金额 =缴费金额-已消耗课时×课单价。超过30天或8节课外不支持退费。<br/>
•	为避免任何歧义，双方同意，甲方在向乙方申请退费的当日及当日之前，因为甲方或者甲方学员自身的原因未能参加或者未能完成的但已经正常结课的课程，甲方无权向乙方申请退费。<br/>因为乙方的原因（包括但不限于乙方的授课教师迟到超过五分钟、临时无法授课、中途因故中止授课、乙方的授课系统出现故障超过五分钟等）导致甲方在申请退费的当日之前未能完成一次或者多次课程的，甲方有权要求乙方退还上述课程相关的课程费用。<br/>
•	退款时，甲方须自费提供并交回已经开具的发票。<br/>如不能提供乙方开具的发票，乙方有权从退款中直接扣除发票金额的8%，以支付当地发票税赋和相关费用。<br/>
•	退款流程和时间通常为批准退款申请日起2至3周，乙方将按照交款时的方式和账号进行退款。<br/>
•	乙方向甲方赠送的课程（如有）将在甲方购买的全部课程使用完毕以后方能开始使用。<br/>如甲方申请退费，甲方在购买课程时赠送的全部课程将自动取消。<br/>
<h2>第五部分 双方的权利义务</h2><br/>
•	甲方的权利和义务：<br/>
•	甲方及学员不得影响乙方的正常运营，不得影响课程进程及其他学员的学习活动。<br/>
•	甲方及学员在课程学习期内，如遇有任何问题，可以随时与乙方的工作人员取得联系。<br/>
•	甲方及学员不得发布不实言论损害乙方或乙方员工的名誉。<br/>
•	在任何情况下，甲方及学员不得以任何方式出售或转让乙方提供的全部或部分培训课程。<br/>
•	甲方同意自行配备宽带上网设备及其他学习乙方课程所需软件和硬件设备。<br/>
•	为保护所有注册人及学员的权益，甲方不得利用乙方网站及系统平台搜集、探询、索取其他学员及学员家长以及老师之个人信息、联络方式(例如电子邮件信箱、QQ账号、Wechat账号、微博等)、交友及财务状况等等。<br/>
•	乙方的权利和义务：<br/>
•	在保证培训质量的前提下，乙方有权改进、调整变更其培训服务、课程安排或其他事项。<br/>但乙方应将上述任何变更通过网站或本协议中列明的联系方式及时通知甲方。<br/>
•	乙方应根据甲方提出的要求，在约定范围内提供相应技术支持服务，并及时回应甲方提出的问题和意见。<br/>
•	因乙方课程变更、知识产权、系统升级、法律纠纷等原因不能继续正常提供在线课程服务时，需要提前2-3周时间告知甲方，并向甲方提供替代性的课程服务，若甲方不同意此替代性的课程服务，则乙方需要给予甲方办理其未消耗课时退费事宜。<br/>退费办理方法和流程参见本协议“第四部分”相关规定。<br/>

<h2>第六部分 个人信息及保密</h2><br/>
•	为便于乙方了解学员情况、更好地履行本协议项下义务，甲方应向乙方提供学员的部分个人信息。<br/>甲方同意乙方可将学员的个人信息用于公司内部的教学管理等目的，但应注意依法严格保护学员的个人隐私。<br/>
•	如甲方提供的学员信息发生变更，甲方应及时通知乙方工作人员；<br/>由于甲方未及时通知的而导致乙方无法联系到甲方、使学员的学习受到影响的，甲方应自行承担责任。<br/>
•	甲方同意应妥善保管其课程账户和密码，并对任何人利用其账户和密码所进行的活动负责。<br/>如学员的账户和密码遭到未获授权的使用，或者发生其他任何安全问题，甲方应立即通知乙方的工作人员，要求乙方工作人员暂停相关服务。<br/>甲方亦不得将其账号和密码出借、转移或者让与第三人使用。<br/>如乙方合理怀疑甲方违反本约定，乙方有权暂时停止甲方账户之使用，如果乙方最终确认甲方违反本约定，乙方有权立即终止本协议。<br/>
•	未经乙方书面同意及授权，甲方不得以任何方式将因本协议之订立或执行所得悉的乙方之技术数据、商业秘密及其他机密资料和信息提供给任何第三人或向第三人披露，如有违反，乙方有权立即终止本协议并要求甲方赔偿其损失。<br/>
<h2>第七部分 知识产权</h2><br/>
•	以下所述资料的所有权及全部、完整的知识产权归乙方享有：<br/>（1）乙方为培训课程所制作的全部资料（包括但不限于教材教辅、课件及教学相关材料等）；<br/>（2）在教学过程中产生的全部资料（包括但不限于任何教学视频、教学方案等）；<br/>（3）乙方网站上所显示、使用或提供之软件、程序及内容。<br/>未经乙方同意，甲方及学员在任何时候（包括本协议有效期内及协议终止后）均不得：<br/>①为商业目的对上述资料进行利用；<br/>②以任何方式翻译、复制、传播、编辑上述资料；<br/>以及③将上述资料透露给任何第三方。<br/>
•	甲方同意，在甲方学员参与的培训课程中，或甲方及学员参与乙方组织、举办的其他活动中，乙方可以进行拍照、摄像、录音、录像等记录活动。<br/>乙方对上述记录活动过程中所产生的作品、录音录像制品等单独地享有全部、完整的知识产权。<br/>乙方同意依法为甲方及学员的个人信息采取严格的保密措施。<br/>未经甲方同意，乙方不得将上述包含甲方及学员肖像或者显示个人身份的其他个人信息进行公开地商业使用。<br/>仅当以下情况之一发生时，乙方可以对甲方的肖像、姓名等个人信息进行合理使用，乙方无须再单独取得甲方同意，也无须向甲方支付任何费用：<br/>（1）甲方及学员的肖像、姓名等合法民事权益，已被明确放弃；<br/>（2）为乙方内部的展示/使用需要，包括但不限于在内部会议中展示、将相关资料作为历史档案留存于乙方档案库或者服务器上等。<br/>
<h2>第八部分 禁止劝诱</h2><br/>
•	乙方的员工、老师（包括外教和中国老师）为其公司存续及发展的重要支撑力量，任何人非经乙方同意不得在使用乙方课程中及课程结束后，以任何方式劝诱、要求、或者邀请乙方的员工或者老师与乙方终止或者解除服务关系，或劝诱、要求、或者邀请乙方的员工或者老师接受由甲方自己或者甲方介绍的其他个人或组织提供（无论正式、兼职、或者临时组织的活动）的任何职务。<br/>
•	如有违反，甲方应当向乙方承担违约金，违约金的金额为上述人员离职前所在的乙方岗位上一年度年薪或报酬的两（2）倍。<br/>
<h2>第九部分 违约责任</h2><br/>
•	本协议任何一方违约，均应承担违约责任，对另一方因此产生的损失承担赔偿责任。<br/>
•	如果乙方违约，甲方有权随时以通知乙方的方式终止本协议，并要求乙方按照本协议第四部分约定的退费方式进行退费。<br/>给甲方造成损失的，乙方应当承担相应违约责任，乙方因未能履行本协议项下的义务而需承担的全部责任的上限为甲方学员支付的课程费用总额。<br/>
•	如果甲方违约，乙方有权随时以通知甲方的方式终止本协议，甲方的违约行为给乙方造成损失的，乙方有权先行在甲方已经支付但尚未使用的课程费用中扣除相应金额。<br/>
<h2>第十部分 其他事项</h2><br/>
•	在甲方的课程到期结束后，本协议自动终止，甲方所拥有的课程账号同时失效。<br/>但本协议的终止不影响第六部分、第七部分和第八部分有关保密知识产权及禁止劝诱条款的效力。<br/>
•	乙方有权不时根据课程和管理改进的需要对本协议及网站的内容进行修改，并在网站中公布。<br/>修改后的协议一旦被张贴在乙方网站上即生效，并代替原来的协议，甲方可随时登录查阅最新协议。<br/>如甲方不同意更新后的协议，应立即书面通知乙方并立即停止接受乙方依据本协议提供的服务；<br/>如甲方未在2个工作日内书面通知乙方或用户继续使用乙方提供的服务的，即视为同意更新后的协议。<br/>
•	协议经甲方确认并同意后，将以电子文件方式留存于乙方公司系统中，以为双方协议签署及遵循的依据。<br/>
•	如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。<br/>
<h2>第十一部分 法律管辖和争议解决</h2><br/>
•	本协议的订立、执行和解释及争议的解决均应适用中华人民共和国法律（不包括特别行政区及台湾地区法律）。<br/>
•	本协议只适用于乙方旗下品牌的常规课课程学员，不包括体验课及其他非常规课程。<br/>协议中未尽事宜，双方依据乙方公司的公示内容为准。<br/>如有任何争议，双方应当尽量友好协商解决。<br/>协商不成，双方同意将争议提交至北京仲裁委员会进行仲裁。<br/>

    </div>
</template>
<script>
    // import isNeedBind from '••/••/common/util';
    export default {
        name: "protocol",
        components: {},
        data: () => {
            return {};
        },
        methods: {},
        created: function () {
            // isNeedBind(this);
            // this•$loading•hide();
        },
        mounted: function () {}
    };
</script>
<style lang="less" scoped>
    @import "../../assets/css/common/variable.less";
    .protocol-wrapper {
        width: 100%;
        padding: 20px;
        box-sizing: border-box;
        color: white;
        background: @bgColor;
        h1 {
            font-size: 32px;
            line-height: 56px;
            text-align: center;
            margin-top: 20px;
        }
        h2 {
            font-size: 28px;
            line-height: 50px;
            margin-top: 20px;
        }
        .p1 {
            font-size: 25px;
            margin-top: 10px;
        }
        .p2 {
            font-size: 24px;
            margin-left: 15px;
            margin-top: 5px;
        }
    }
</style>
